Repository: amcharts/amcharts-wp
Catalog: langs/amcharts-*.po
Languages: lt_lt

source: Resources
lt_lt: Ištekliai

source: Apply default code
lt_lt: Taikyti numatytąjį kodą

source: Chart tools
lt_lt: Grafikų įrankiai

source: Select a resource
lt_lt: Pasirinkite išteklius

source: Add
lt_lt: Pridėti

source: Please use the following code <strong>$CHART$</strong> in place of the chart IDs or variables. It will be replaced with the proper, safe and unique chart ID when generating the page
lt_lt: Naudokite kodą <strong>$CHART$</strong> vietoj grafiko identifikatorių arba kintamųjų. Šis kodas bus pakeistas unikaliu grafiko identifikatoriumi, kas padės išvengti konfliktų.

source: Select a chart type to apply
lt_lt: Pasirinkite, kurį grafiko tipą norite pritaikyti

source: Apply
lt_lt: Taikyti

source: ATTENTION! When you select a chart type above and click "Apply", the content in Resources, HTML and JavaScript fields will be overwritten with the defaults set by the website administrator.
lt_lt: DĖMESIO! Kai pasirinksite grafiko tipą ir paspausite "Taikyti", langelių "Ištekliai", "HTML" ir "JavaScript" turinys bus pakeistas numatytaisiais.

source: Slug
lt_lt: Indentifikatorius

source: Use this field to enter a user-friendly slug (ID) for your chart that can be used in shortcodes, i.e. [amcharts id="chart-1"]
lt_lt: Naudokite šį lauką patogiam grafiko identifikatoriui įvesite. Vėliau jį galėsite naudoti trumpiniuose, pvz. [amcharts id="chart-1"]

source: Preview chart or map
lt_lt: Peržiūrėti grafiką arba žemėlapį

source: Shortcode
lt_lt: Trumpasis kodas

source: Insert chart or map
lt_lt: Įterpti grafiką ar žemėlapį

source: Select a chart or map to insert
lt_lt: Pasirinkite grafiką ar žemėlapį, kurį norėtumėte įterpti

source: Are you sure? This operation cannot be undone.
lt_lt: Ar tikrai? Šis veiksmas neatšaukiamas.

source: Search results
lt_lt: Paieškos rezultatai

source: Recent charts
lt_lt: Naujausi grafikai

source: amCharts Preview
lt_lt: amCharts peržiūra

source: You do not have sufficient permissions to access this page.
lt_lt: Jūs neturite pakankamai teisių patekti į šį puslapį.

source: Settings were successfully saved!
lt_lt: Nustatymai sėkmingai išsaugoti!

source: amCharts: Settings
lt_lt: amCharts: Nustatymai

source: Version
lt_lt: Versija

source: This section specifies which major version of amCharts library is used.
lt_lt: Šioje sekcijoje valdoma, kurią amCharts versiją norite naudoti.

source: Switch Version
lt_lt: Pakeisti versiją

source: Switch to
lt_lt: Pakeisti į

source: The following will happen when you click the button above:
lt_lt: Kai paspausite viršue esantį mygtuką, bus atlikti tokie veiksmai:

source: Resource list below will be updated automatically (custom reseources will remain intact).
lt_lt: Išteklių sąrašas bus automatiškai atnaujinatas (papildomi nurodyti ištekliai išliks).

source: Defaults will be replaced with the ones appropriate for the target version.
lt_lt: Numatytos reiškmės bus pakeistos taip, kad atitiktų pasirinktą versiją.

source: The chart type list will slightly change as per target version capabilities.
lt_lt: Grafikų tipų pasirinkimas pasikeis pagal pasirinktos versijos galimybes.

source: Charts created previously will not be affected.
lt_lt: Anksčiau sukurti grafikai liks nepakitę.

source: Resource Storage
lt_lt: Išteklių vieta

source: Resources are stored remotely
lt_lt: Ištekliai yra saugomi kitame serveryje

source: The free versions of libraries will be loaded from www.amcharts.com. These are fully functional but will show a small branding link on charts or maps.
lt_lt: Nemokama amCharts bibliotekos versija bus kraunama iš www.amcharts.com. Šios bibliotekos yra pilnai funkcionalios, tačiau rodys mažą amCharts nuorodą kampe.

source: Want a link-free version? <a href="http://www.amcharts.com/online-store/" target="_blank">Purchase a commercial version</a> and help the development of this product as well as increase your karma points in the process.
lt_lt: Norite versijos be reklaminės nuorodos? <a href="http://www.amcharts.com/online-store/" target="_blank">Įsigykite komercinę versiją</a> ir prisidėkite prie šio puikaus produkto kūrimo.

source: Resources are stored locally
lt_lt: Ištekliai laikomi šiame serveryje

source: This allows you to load the libraries from the local server.
lt_lt: Šis nustatymas leis amCharts bibliotekas krauti iš šito serverio.

source: Relative Resource URLs
lt_lt: Santykiniai išteklių URL

source: Use relative resources URLs, instead of full URLs
lt_lt: Naudoti santykinius išteklių URL, o ne pilną URL

source: NOTE: Changing this setting will not affect charts that are already created.
lt_lt: DĖMESIO: Šio nustatymo pakeitimas neįtakos anksčiau išsaugotų grafikų ar žemėlapių.

source: Live Editor Integration
lt_lt: Integracija su Live Editor

source: Use local amCharts libraries for Live Editor-hosted charts
lt_lt: Naudoti šiame serveryje esančias amCharts bibliotekas Live Editor grafikams

source: If you want to display Live Editor-created charts without branding link:
lt_lt: Jei norite Live Editor grafikus rodyti be reklaminės amCharts nuorodos:

source: Install commercial version of amCharts libraries.
lt_lt: Įdiekite komercines amCharts bibliotekų versijas.

source: Check "Resources are stored locally" above.
lt_lt: Pažymėkite aukščiau esantį "Ištekliai laikomi šiame serveryje".

source: You may need to also click "Find them for me" button under "Local Paths".
lt_lt: Gali reikėti paspausti "Raskite juos" mygtuką, esantį po "Vietinės direktorijos" laukeliu.

source: Check "Use local amCharts libraries" above.
lt_lt: Pažymėkite aukščiau esantį "Naudoti vietines amCharts bibliotekas".

source: Error Handling
lt_lt: Klaidų valdymas

source: Use exception handling on chart and map code (recommended)
lt_lt: Įvilkti grafikų ir žemėlapių kodą į "išimtis" (exception). (rekomenduotinas nustatymas)

source: If checked, the code for charts and maps will be wrapped with exception handling code (try / catch).
lt_lt: Jei pažymėsite šį nustatymą, grafikų ir žemėlapių kodas bus įvilktas į (try / catch) klaidų išimčių kodą.

source: This will make sure a faulty code does not prevent other JavaScript on the same page executing properly.
lt_lt: Tai padės užtikrinti, kad klaidingas kodas viename grafike neužkirs kelio tolimesniam puslapio JavaScript vykdymui.

source: Local Paths
lt_lt: Vietinės direktorijos

source: Enter paths to your amCharts folders. Separate them by line breaks. The paths must be relative to your web root.
lt_lt: Nurodykite direktorijas, kuriose laikote amCharts failus. Kiekvieną direktoriją pradėkite naujoje eilutėje. Direktorijos turi būti nurodomos santykinai jūsų interneto svetainės pagrindinei direktorijai.

source: If you are not sure what to do, just unzip the amCharts archive you have downloaded and put into some directory under your web root. Then click "Find them for me".
lt_lt: Jeigu nesate tikra(s), ką čia reikėtų daryti, tiesiog išarchyvuokite atsisiųstą amCharts ZIP failą į kokią nors direktoriją savo web serveryje. Tą padarę, spustelkite "Raskite juos" mygtuką.

source: Find them for me
lt_lt: Raskite juos

source: amCharts library was not found on your server
lt_lt: Šiame serveryje neradome jokių amCharts bibliotekų.

source: Resource List
lt_lt: Išteklių sąrašas

source: This is a list of resources available for use. You will be able to select them while creating charts or maps.
lt_lt: Tai yra naudotinų išteklių sąrašas. Juos galėsite pasirinkti kurdami grafikus ar žemėlapius.

source: Refresh the list
lt_lt: Atnaujinti sąrašą

source: Attention! Pressing this button will save current settings.
lt_lt: Dėmesio! Paspaudus šį mygtuką, nustatymai bus išsaugoti.

source: Custom Resources
lt_lt: Papildomi ištekliai

source: Add your own resources here. Full or relative URLs (we include them the way you have them here). Separate by line break.
lt_lt: Šia galite pridėti savo nuosavus papildomus išteklius. Naudokite pilnus ar santykinius URL (mes juos įtrauksime į kodą taip, kaip nurodyta). Kiekvieną išteklių pradėkite naujoje eilutėje.

source: Defaults
lt_lt: Numatytos reikšmės

source: This section allows setting default resources, HTML and JavaScript code per chart/map type.
lt_lt: Šiame skyriuje kiekvienam grafiko/žemėlapio tipui galėsite nustatyti numatytasias išteklių, HTML ir JavaScript laukelių reikšmes.

source: When creating new chart or map entry, you will be able to select from one of these presets.
lt_lt: Kuriant naują grafiką ar žemėlapį, galėsite pasirinkti vieną iš šių numatytųjų nustatymų.

source: We did not find libraries required for this chart type in your local storage.
lt_lt: Jūsų serveryje neradome bibliotekų, reikalingų šio grafiko tipo rodymui.

source: Make sure you hit the "Refresh the list" button higher on this page when you install them.
lt_lt: Būtinai paspauskite aukščiau esantį mygtuką "Atnaujinti sąrašą" po to, kai jas įdiegsite.

source: I want to manage resource list myself
lt_lt: Aš pats noriu valdyti išteklių sąrašą

source: If the above box unchecked, plugin will manage required resources and their urls for you. If this is checked, you're on your own ;)
lt_lt: Jei nuimsite žymę nuo aukščiau esančio laukelio, šis įskiepis pats valdys reikalingų išteklių sąrašus ir jų URL. Jei laukelis pažymėtas - už resursus liekate atsakingi jūs ;)

source: Enter the default HTML to populate new entries with. Use <strong>$CHART$</strong> symbol for safe and unique chart ids and variables.
lt_lt: Įveskite numatytąjį HTML, kuris bus naudojamas kuriant naujus įrašus. Naudokite <strong>$CHART$</strong> ten, kur norite, kad būtų sugeneruotas unikalus ir saugus identifikatorius.

source: Enter the default JavaScript to populate new entries with. Use <strong>$CHART$</strong> symbol for safe and unique chart ids and variables.
lt_lt: Įveskite numatytąjį JavaScript, kuris bus naudojamas kuriant naujus įrašus. Naudokite <strong>$CHART$</strong> ten, kur norite, kad būtų sugeneruotas unikalus ir saugus identifikatorius.

source: Charts &amp; Maps
lt_lt: Grafikai ir žemėlapiai

source: Chart or Map
lt_lt: Grafikas ar žemėlapis

source: Add New
lt_lt: Pridėti naują

source: Add New Chart or Map
lt_lt: Pridėti naują grafiką ar žemėlapį

source: Edit Chart or Map
lt_lt: Redaguoti grafiką ar žemėlapį

source: New Chart or Map
lt_lt: Naujas grafikas ar žemėlapis

source: View Chart or Map
lt_lt: Peržiūrėti grafiką ar žemėlapį

source: Search Charts &amp; Maps
lt_lt: Ieškoti tarp grafikų ir žemėlapių

source: No charts or maps found
lt_lt: Neradome nei vieno grafiko ar žemėlapio

source: No charts or maps found in Trash
lt_lt: Šiukšliadėžėje neradome nei vieno grafiko ar žemėlapio

source: Local Charts
lt_lt: Vietiniai grafikai

source: Enter a URL to a chart created in Live Editor
lt_lt: Įveskite nuorodą Live Editor sukurto grafiko

source: Once you publish the chart in Live Editor, copy and paste it's URL into field above.
lt_lt: Po to, kai publikuosite grafiką Live Editor, nukopijuokite jo URL į aukščiau esantį laukelį.

source: I.e.: https://live.amcharts.com/NmU2Z/
lt_lt: Pvz.: https://live.amcharts.com/NmU2Z/

source: Width (default: 400px)
lt_lt: Plotis (numatytas: 400px)

source: Height (default: 300px)
lt_lt: Aukštis (numatytas: 300px)

source: Insert
lt_lt: Įterpti

source: Open Live Editor
lt_lt: Atidaryti Live Editor

source: This will open Live Editor in a new window
lt_lt: Paspaudus, bus atidarytas naujas langas su Live Editor

source: Start typing to search
lt_lt: Pradėkite rašyti, kad ieškotume

source: Please enter a chart URL
lt_lt: Įveskite grafiko nuorodą (URL)

source: Use this plugin to easily add interactive charts and maps using amChart's JavaScript Charts and JavaScript Maps products
lt_lt: Naudokite šį įskiepį, jei norite lengvai pagyvinti savo interneto svetainę interaktyviais grafikais ar žemėlapiais, naudojant amCharts JavaScript Charts ar JavaScript Maps produktus
